habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
} // END OF calculateChannelCurrent



/********************************************************************************************************
* @brief Calculates the CHANNEL mean, max, min and RMS voltage.
*
* @author original: Hab Collector \n
*
* @note: TODO MORE NOTES
* @note: TODO MORE NOTES
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param ADC_VoltMonitorCount: ADC Count from ADC channel for the specific voltage monitor
* @param FIFO_AmpMon: FIFO structure associated with the specific Volt Monitor channel
* @param VoltageMeasure: ArbPwrBooster measure struct associated with the specific channel
*
* STEP 1: Calculate the mean of the Current Monitor
* STEP 2: Calculate the instantaneous current
* STEP 3: Update Min current - If Min set to zero overwrite with present value
* STEP 4: Update Max current - if Max set to zero overwrite with present value
* STEP 5: Calculate the RMS current
********************************************************************************************************/
static void calculateChannelVoltage(double ADC_VoltMonitorCount, Type_16b_FIFO *FIFO_VoltMon, Type_ChannelMeasure *VoltageMeasure)
{
    // TODO Hab Min Max needs work - Think about a periodic reset
    // TODO Hab need to add an RMS measure - do it the same as calculateChannelCurrent()
    // TODO Change paramater VoltageMeasure and AmpMeasure to just Measure here and calculateChannelCurrent()
    // STEP 1: Calculate the mean of the Voltage Monitor
    double MeanVoltageCount = 0.0;
    MeanVoltageCount = FIFO_VoltMon->Sum / FIFO_VoltMon->Depth;
    VoltageMeasure->MeanVoltage = MeanVoltageCount * LSB_12BIT_VALUE * System_ADC_Reference * DIVIDER_VOLT_MON_CONVERSION;

    // STEP 2: Calculate the instantaneous current
    double VoltMonitorVoltage = ADC_VoltMonitorCount * LSB_12BIT_VALUE * System_ADC_Reference * DIVIDER_VOLT_MON_CONVERSION;

    // STEP 3: Update Min current - If Min set to zero overwrite with present value
    if (VoltageMeasure->MinVoltage == 0)
        VoltageMeasure->MinVoltage = VoltMonitorVoltage;
    else if (VoltMonitorVoltage < VoltageMeasure->MinVoltage)
        VoltageMeasure->MinVoltage = VoltMonitorVoltage;

    // STEP 4: Update Max current - if Max set to zero overwrite with present value
    if (VoltageMeasure->MaxVoltage == 0)
        VoltageMeasure->MaxVoltage = VoltMonitorVoltage;
    else if (VoltMonitorVoltage > VoltageMeasure->MaxVoltage)
        VoltageMeasure->MaxVoltage = VoltMonitorVoltage;
}



void monitorTaskInit(void)
{

}


void monitorTaskActions(void)
{
    if (!ArbPwrBooster.Ready)
        return;

//    // STEP 1: Verify input supply voltages are valid
//    if ((ArbPwrBooster.SystemMeasure.Positive_20V >= POS_SUPPLY_LOWER_LIMIT) && (ArbPwrBooster.SystemMeasure.Positive_20V <= POS_SUPPLY_UPPER_LIMIT) && \
//        (ArbPwrBooster.SystemMeasure.Negative_20V >= NEG_SUPPLY_LOWER_LIMIT) && (ArbPwrBooster.SystemMeasure.Negative_20V <= NEG_SUPPLY_UPPER_LIMIT))
//    {
//        MAIN_PWR_ON();
//    }
//    else
//    {
//        CH1_OUTPUT_DISABLE();
//        CH2_OUTPUT_DISABLE();
//        MAIN_PWR_OFF();
//        return;
//    }

    // STEP 2: Check for short circuit conditions

    // STEP 3: Check for current limit conditions

    // STEP 3: Make task inactive for a period of time
    osDelay(MONITOR_UPDATE_RATE);
}



/********************************************************************************************************
* @brief ADC1 is configured for DMA single shot conversion mode.  At the end of each conversion the ADC must
* be restarted for the next conversion.  Issue this command to start a conversion.  When the conversion is
* completed the results will be handled in HAL_ADC_ConvCpltCallback().  As this is single shot, you must call
* this function at the end of conversion if you want another conversion - and so on and so on.
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
********************************************************************************************************/
void ADC1_StartConversion(void)
{
    // STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
    HAL_ADC_Start_DMA(&hadc1, (uint32_t *)ADC1_CountValue, ADC1_NUMBER_OF_CHANNELS);

}  // END OF ADC1_StartConversion



/********************************************************************************************************
* @brief Checks the system values of +20V, -20V, Temperature and Vref to see if they are within the specified
* limits of operation.  All errors are OR together to the error variable, but only the first error description
* is returned.
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* STEP 1: Check System +20V
* STEP 2: Check System -20V
* STEP 3: Check System Vref
* STEP 4: Check System Temperature
* STEP 5: For no error
********************************************************************************************************/
bool systemMeasureWithinLimits(char *ErrorDescription, uint8_t *ErrorNumber)
{
    bool FirstErrorFound = false;
    *ErrorNumber = CONFIG_NO_ERROR;

    // STEP 1: Check System +20V
    if ((ArbPwrBooster.SystemMeasure.Positive_20V > POS_20V_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.Positive_20V < POS_20V_LOWER_LIMIT))
    {
        *ErrorNumber |= (1 << CONFIG_POS_20V_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "+20V: %3.1fV to %3.1fV", POS_20V_LOWER_LIMIT, POS_20V_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 2: Check System -20V
    if ((ArbPwrBooster.SystemMeasure.Negative_20V > NEG_20V_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.Negative_20V < NEG_20V_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_NEG_20V_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "-20V: %3.1fV to %3.1fV", NEG_20V_LOWER_LIMIT, NEG_20V_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 3: Check System Vref
    if ((ArbPwrBooster.SystemMeasure.VDD_VDREF > SYSTEM_3V3_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.VDD_VDREF < SYSTEM_3V3_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_VREF_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "VREF: %4.3fV to %4.3fV", SYSTEM_3V3_LOWER_LIMIT, SYSTEM_3V3_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 4: Check System Temperature
    if ((ArbPwrBooster.SystemMeasure.TempDegreeC > SYSTEM_TEMP_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.TempDegreeC < SYSTEM_TEMP_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_TEMP_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "%dC < Temp < %dC", SYSTEM_TEMP_LOWER_LIMIT, SYSTEM_TEMP_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 5: For no error
    if (*ErrorNumber == CONFIG_NO_ERROR)
    {
        sprintf(ErrorDescription, "I'm good how about you.");
        return(true);
    }
    else
    {
        return(false);
    }

} // END OF systemMeasureWithinLimits




